import React from "react";
import photo from "../../images/homepic2.jpeg";
import photoo from "../../images/vision32.jpeg";
// import { GiAbbotMeeple } from "react-icons/gi";
import "./style.css";
///////////////////////////////////////////////////////////////////////////////
const Home = () => {
  return (
    <div>
      <img className="backImg" src={photo} alt="backImg" />
      <h4 className="headerText1">
        رؤية السعودية 2030 تُنهي الخمس السنوات الأولى بتأسيس بنية تحتية متينة،
        وعهد جديد من القوة والتمكين للوطن والمواطن، وتبدأ المرحلة التالية التي
        تُعنى بالتنفيذ ودفع عجلة الإنجاز وصولا إلى تحقيق مستهدفات الرؤية.
      </h4>
      <h1 className="title">
        نبذة حول رؤية 
        2030
      </h1>

      <div className="pragraphs">
        <div className="pragraph1">
          <b>
            خلال السنوات الخمس الماضية، تم تحقيق عديد من الإنجازات، وتبلور عدد
            من ممكّنات التحول، التي أسهمت في تحقيق نتائج ملموسة، على صعيد منظومة
            العمل الحكومي والاقتصاد والمجتمع، وأرست أسس النجاح للمستقبل. لقد
            واجهنا عديدًا من التحديات، واكتسبنا عديدًا من الخبرات التي عززت
            ثقتنا في تحقيق أهدافنا، وعملنا على زيادة فعالية الحكومة واستجابتها،
            من خلال الاستثمار في التحول الرقمي الحكومي، وخلقنا فرصاً للنمو
            والاستثمار، واستحدثنا عدداً من القطاعات الاقتصادية الجديدة، وفتحنا
            أبوابنا للعالم، ورفعنا مستوى جودة حياة المواطنين، وتمت كل تلك
            الإنجازات بأيدي أبناء هذا الوطن العظيم وبناته.
          </b>
        </div>
        <div className="pragraph2">
          <b>
            بدعم ورعاية خادم الحرمين الشريفين حفظه الله، أُطلقت رؤية المملكة
            2030، وهي رؤية سمو ولي العهد لمستقبل هذا الوطن العظيم، والتي تسعى
            لاستثمار مكامن قوّتنا التي حبانا الله بها، من موقع استراتيجي متميز،
            وقوة استثمارية رائدة، وعمق عربيّ وإسلاميّ، حيث تولي القيادة لذلك كل
            الاهتمام، وتسخّر كل الإمكانات لتحقيق الطموحات.
          </b>
        </div>
      </div>
      <img className="backImgs" src={photoo} alt="backImg" />
    </div>
  );
};

export default Home;
